[
  {
    "title": "Mobile Software Engineer (All levels - Android and iOS)",
    "company": "Uber",
    "salary": "Salary",
    "location": "Toronto, ON",
    "reviews": "2,644 reviews",
    "stars": "3.6 out of 5 stars from 2,644 employee ratings",
    "jobType": [
      "Salary",
      "$157,000–$174,500 a year"
    ],
    "jobDescription": "About the Role:\n \n \n \n   We are hiring mobile engineers for all levels across Mobility and Uber Eats teams in \n  San Francisco, Seattle, Boulder, and Toronto.\n \n \n \n   Our Uber Eats team directly impacts and continues to impact our communities. Uber Eats core teams are Restaurants, Couriers, Eaters, & Marketplace which support the exciting technical challenges of a 3-sided market. Uber's world-class engineers are empowered to push the envelope in scalability, distributed systems, mobile development, machine learning /personalization /recommendation systems, & development for drone delivery.\n \n \n \n   The Mobility Engineering Team is one of the key players that drives profitability and growth of our company. It's the bread and butter of Uber! The Mobility Team is home to Rider, Driver, U4B (Uber for Business), and Marketplace sub-teams that operate like startups within Uber. Some of the things our engineers are working on are in the first iteration, which means that you have the ability to design the future of some of our product offerings.\n \n \n \n   Come join our team and work on the frontlines of building Uber's core technology used by millions of users in 10,000 cities worldwide!\n \n \n \n   What You'll Do: \n \n \n  Collaborates with team members to design, develop, and maintain user interfaces and features for mobile applications (Android or iOS).\n \n  Basic Qualifications:\n \n   Bachelor's degree or equivalent in Computer Science, Engineering, Mathematics or related field\n   Minimum 1 year full-time Software Engineering work experience, WHICH INCLUDES 1 year total technical software engineering experience in one or more of the following areas:\n   \n     Android Development\n     Android java, or Android Kotlin\n     Native iOS\n     iOS swift, iOS objective C\n   \n \n  Preferred Qualifications:\n \n   Experience in below preferred technical skills:\n   \n     Buck/Bazel\n     Cross-platform (Android and iOS)\n   \n \n  \n  For Boulder, CO-based roles: The base salary range for this role is $157,000 per year - $174,500 per year.For San Francisco, CA-based roles: The base salary range for this role is $174,000 per year - $193,500 per year.For Seattle, WA-based roles: The base salary range for this role is $174,000 per year - $193,500 per year.For Sunnyvale, CA-based roles: The base salary range for this role is $174,000 per year - $193,500 per year.For all US locations, you will be eligible to participate in Uber's bonus program, and may be offered an equity award & other types of comp. You will also be eligible for various benefits. More details can be found at the following link https://www.uber.com/careers/benefits.",
    "jobActivity": [
      "Posted 30+ days ago"
    ],
    "benefits": [],
    "hiringInsights": []
  },
  {
    "title": "Junior Software Engineer",
    "company": "Lockheed Martin Corporation",
    "salary": "Job type",
    "location": "Halifax, NS",
    "reviews": "9,109 reviews",
    "stars": "4 out of 5 stars from 9,109 employee ratings",
    "jobType": [
      "Job type",
      "Full-time",
      "Permanent"
    ],
    "jobDescription": "Engineering\n    \n  \n  \n   \n    Halifax, NS \n   \n  \n  \n   \n    12280BR\n    \n  \n  \n   About the role \n   \n    Software Development work related to the Canadian Surface Combatant (CSC) Project as well as Internal Research and Development (IRAD) projects. Software Development includes both new development and maintenance of existing software.\n     \n     Tasks include:\n    \n      Requirements Analysis\n      Detailed design\n      Software development in both Java 11+ and C++\n      Designing new Graphical User Interfaces in JavaFx\n      Unit testing and documentation\n      Integration and deployment\n      Problem solving\n      Working with Product Owner (PO) and Subject Matter Experts (SMEs) to analyze requirements and deliver a user focused product\n      Working in an Agile team environment (Scrum)\n    \n    \n  \n  \n   What you bring to the role \n   \n    \n     Degree in Computer Science, Software Engineering, Electrical Engineering, Computer Engineering, or equivalent\n      0-3 years professional experience\n      Experience with Java\n      Proficient in Linux\n      Eligibility for NATO Secret Clearance.\n    \n    \n  \n  \n   Additional skills desired for the role \n   \n    \n     Knowledge of Agile software development process\n      Familiar with Agile Software Tools (Jira)\n      Familiar with JavaFX\n      Familiar with automated testing\n      Test Driven Development (TDD)\n    \n    \n  \n  \n   What we offer you \n   \n    We walk our talk when it comes to work/life balance! Your physical, mental and financial wellbeing matters to us. On top of working in a highly supportive, friendly, respectful environment, this is what you can expect when you join our team:\n     \n    \n      Flexible, compressed work schedules, depending on business requirements, where you have the option of Fridays off, as well as the possibility to work remote part-time \n      Competitive compensation \n      Time to recharge with vacation, personal days, holidays, and parental leaves \n      Comprehensive Family Medical, Dental and Vision coverage available on your first day of employment, along with:  \n      \n       Virtual Health Care (24/7 access to medical professionals) \n        A Wellness Spending Account to aid in your wellness journey \n        Employee & Family Assistance Program (EFAP) which includes free face to face counselling sessions \n        Medical Travel Insurance \n        Onsite fitness facilities at our main office locations\n      \n      A Registered Retirement Savings Plan that includes matching company contributions on your first day of employment, that also includes access to Financial Advisors providing investment advice and comprehensive financial planning \n      Employee discounts to save on goods, services and various recreational activities \n      Access to a robust spectrum of development resources to enhance your skills and/or advance your career including:  \n      \n       Free learning resources through a modern and engaging platform \n        Education Assistance Program \n        Reimbursement for a professional membership \n        Self-directed Mentoring\n      \n    \n    \n  \n  \n   About us \n   \n    Lockheed Martin Canada is the Canadian-based arm of Lockheed Martin Corporation, a global security and aerospace company employing 110,000 people worldwide, including more than 1,000 Canadians. By applying innovative approaches of our highly skilled and experienced Canadian workforce, we have been Canada’s trusted defence and aerospace partner for over 80 years. We operate major facilities in Ottawa, Montreal, Halifax, Calgary and Victoria and work on a wide range of programs from advanced naval technology products and unmanned systems software to providing delivery and in-service support of the latest military aircraft to commercial engine repair and overhaul capabilities. This position is part of the Rotary and Mission Systems business area, where employees across Canada support engineering, systems integration, training, sustainment and in-service support programs for Canadian and international military customers across land, air and sea.\n    \n  \n  \n   Equal Opportunity Statement \n   \n    Lockheed Martin Canada is an equal opportunity employer that values diversity in the workplace. We are committed to excellence in serving all customers, including people with disabilities, and we encourage feedback on the provision of these services.\n    \n  \n  \n   Employee Type \n   \n    Full Time \n   \n  \n  \n   Vacancy Type \n   \n    Permanent\n    \n  \n  \n   Clearance required for role \n   \n    Nato Secret",
    "jobActivity": [
      "Posted 30+ days ago"
    ],
    "benefits": [
      "Dental careRRSP matchVision care"
    ],
    "hiringInsights": []
  },
  {
    "title": "CAD/CAM Programmer",
    "company": "High Strength Plates & Profiles Inc.",
    "salary": "Salary",
    "location": "Lively, ON",
    "reviews": "5 reviews",
    "stars": "3.8 out of 5 stars from 5 employee ratings",
    "jobType": [
      "Salary",
      "$25–$30 an hour"
    ],
    "jobDescription": "HSPP is currently seeking an experienced CAD/CAM Programmer. We are looking for someone who has 3-5 years’ experience, working within a manufacturing or steel industry. The chosen candidate must be a self-motivated individual, who has strong communication skills, and thrives working in a team environment. HSPP is a family-owned company with many long-term employees and a history of supporting growth from within. We have a dynamic and team-oriented environment that emphasizes values of diversity, integrity and professionalism.\nRoles and Responsibilites\n\n Operation of our current/future software packages including SolidWorks, AutoCAD, ProNest, Mastercam and custom ERP software, for the purposes of providing drawings, NC code, and other related support for our CNC machines and operators.\n Measuring and inspecting profiled parts or customer samples in order to create an electronic file when one is not provided\n Reading and producing engineering drawings for the production of sales orders\n Assigning CNC code and material for nested patterns\n Sort shop orders into groups to maximize materials utilization and minimize machine setup time\n\nRequirements\n\n Proficiency in AutoCad and Solidworks is required\n Knowledge of Matercam and Pronest is desirable\n Good knowledge of plasma cutting, machining and brake press forming concepts (such as cutting tolerances, kerf values, machining allowances, developed sizes, bend radii, ID/OD, countersinking, tapping, milling, drill feed/speed, plasma bevels, bevel lands, etc.)\n Machine shop or burning machine operating background is a definite asset.\n Excellent communication skills and quality assurance are required\n\nWe thank all applicants for their interest, however, only those candiates selected for interviews will be contacted.\nJob Types: Full-time, Permanent\nSalary: $25.00-$30.00 per hour\nBenefits:\n\n Dental care\n Disability insurance\n Employee assistance program\n Extended health care\n Life insurance\n RRSP match\n Vision care\n\nSchedule:\n\n 8 hour shift\n Day shift\n Monday to Friday\n Night shift\n\nAbility to commute/relocate:\n\n Lively, ON: reliably commute or plan to relocate before starting work (required)\n\nExperience:\n\n AutoCAD: 2 years (required)\n\nWork Location: One location",
    "jobActivity": [
      "Posted 11 days ago"
    ],
    "benefits": [
      "Dental careDisability insuranceEmployee assistance programExtended health careLife insuranceRRSP matchVision care"
    ],
    "hiringInsights": [
      "Hiring 1 candidate for this role"
    ]
  },
  {
    "title": "developer, software",
    "company": "Fintelics Technology Inc",
    "salary": "Salary",
    "location": "North York, ON",
    "reviews": "",
    "stars": "",
    "jobType": [
      "Salary",
      "$43.50 an hour"
    ],
    "jobDescription": "Education: Bachelor's degree \n  Experience: 1 year to less than 2 years \n  Tasks\n   Write, modify, integrate and test software code\n   Maintain existing computer programs by making modifications as required\n   Identify and communicate technical problems, processes and solutions\n   Prepare reports, manuals and other documentation on the status, operation and maintenance of software\n   Assist in the collection and documentation of user's requirements\n   Assist in the development of logical and physical specifications\n   Research and evaluate a variety of software products\n   Write, modify, integrate and test software code for e-commerce and other Internet applications\n   Computer and technology knowledge\n   API\n   Android\n   Assembler\n   CSS\n   Git\n   HTML\n   Internet\n   JQuery\n   JavaScript\n   Linux\n   Microsoft Visual Studio\n   React.js\n   Xcode\n   Work conditions and physical capabilities\n   Fast-paced environment\n   Work under pressure\n   Tight deadlines\n   Attention to detail\n   Personal suitability\n   Accurate\n   Client focus\n   Efficient interpersonal skills\n   Initiative\n   Organized\n   Team player\n   Workplace information\n   Remote work available \n  Work Term: Permanent \n  Work Language: English \n  Hours: 30 hours per week",
    "jobActivity": [
      "Posted today"
    ],
    "benefits": [],
    "hiringInsights": []
  },
  {
    "title": "Senior AI Developer",
    "company": "Intact",
    "salary": "Job type",
    "location": "Toronto, ON",
    "reviews": "418 reviews",
    "stars": "3.7 out of 5 stars from 418 employee ratings",
    "jobType": [
      "Job type",
      "Full-time"
    ],
    "jobDescription": "Who needs insurance? Everybody. That keeps us busy. Very busy. At the Intact Lab, we use machine learning, data science, software engineering, AI, agility, UX and design thinking to transform the customer experience for millions of Canadians. Simplifying insurance takes creativity, empathy and hard work. We explore, take risks, make mistakes, and learn all day, every day. Here, innovation is everyone's job. Ready to make your mark? \n \n About the role\n \n  At Intact we’ll give you countless opportunities to learn and grow, alongside a diverse and passionate community of experts – the best the industry has to offer. You’ll be empowered to be your best self, do your best work, and make a meaningful impact. Here, you can: shape the future of insurance, win as a team, and grow with us.\n \n  Alongside a multidisciplinary team in a high-performance environment that promotes autonomy, you will work to solve complex problems and challenges and execute fresh ideas to help push the needle forward and meet the evolving needs of our customers. \n \n What you’ll do here\n \n \n   Participate in the design, development and evolution of microservices, APIs and reusable libraries for the execution of our algorithms in mission critical production environments\n   Participate in the technological watch and definition of development standards to ensure system efficiency, resilience, and sustainability\n   Optimize the platform for maximum velocity and scalability\n   Optimize and prioritize development tasks in collaboration with the team\n   Help our testers in setting up component and integration tests\n   Ensure the high level of quality of the work delivered\n   Strengthen the development team’s productivity\n   Oversee the development of appropriate tactics to achieve objectives\n   Support and be proactively involved in issues as they arise\n   Play a Technical Leader / Mentor role for Squad members\n   Need to interact on a regular basis with colleagues across the country\n \n \n  What you bring to the table\n \n \n   Bachelor’s degree in computer engineering, computer science or software engineering, with experience in the development of enterprise grade software solutions\n   5+ years experience in software development.\n   Proficiency in Python language and a good understanding of programming languages such as Java and Bash\n   Good understanding of machine learning concepts and algorithm design techniques\n   Experience with machine learning libraries and scientific calculation such as Scikit-learn, NumPy, SciPy\n   Experience with the software engineering life cycle and agile methodologies\n   Experience in developing complex services based on Docker, Kubernetes, Flask and Spring Boot\n   Experience with modern DevOps tools such as Gitlab, Grafana, ELK stack, Jenkins\n   Working knowledge of streaming and batch processing systems such as Kafka\n   Familiarity with machine learning and data processing frameworks such as XGBoost, Tensorflow or Spark\n   Familiarity with data storage and warehousing technologies such as Snowflake, MongoDB, S3\n   Familiarity with AWS technologies such as Kinesis, Lambda and CloudWatch is a plus.\n \n \n  #LI-Hybrid #LI-IT\n \n  What we offer\n \n  Working here means you'll be empowered to be and do your best every day. Here is some of what you can expect as a permanent member of our team: \n \n  A financial rewards program that recognizes your success \n  An industry leading Employee Share Purchase Plan; we match 50% of net shares purchased \n  An extensive flex pension and benefits package, with access to virtual healthcare \n  Flexible work arrangements \n  Possibility to purchase up to 5 extra days off per year \n  An annual wellness account that promotes an active and healthy lifestyle \n  Access to tools and resources to support physical and mental health, embracing change and connecting with colleagues \n  A dynamic workplace learning ecosystem complete with learning journeys, interactive online content, and inspiring programs \n  Inclusive employee-led networks to educate, inspire, amplify voices, build relationships and provide development opportunities\n   Inspiring leaders and colleagues who will lift you up and help you grow \n  A Community Impact program, because what you care about is a part of what makes you different. And how you contribute to your community should be just as unique \n \n \n We are an equal opportunity employer\n \n  At Intact, we value diversity and strive to create an inclusive, accessible workplace where all individuals feel valued, respected, and heard. \n \n If we can provide a specific adjustment to make the recruitment process more accessible for you, please let us know when we reach out about a job opportunity. We’ll work with you to meet your needs. \n \n Click here to review other important information about the hiring process, including background checks, internal candidates, and eligibility to work in Canada. \n If you are an employee of Intact, belairdirect, or Johnson Insurance, please apply for this role on Contact People.",
    "jobActivity": [
      "Posted 30+ days ago"
    ],
    "benefits": [
      "Extended health care"
    ],
    "hiringInsights": []
  },
  {
    "title": "Staff Software Engineer - Remote",
    "company": "Dropbox",
    "salary": "Job type",
    "location": "Toronto, ON",
    "reviews": "",
    "stars": "",
    "jobType": [
      "Job type",
      "Remote"
    ],
    "jobDescription": "Role Description Our Engineering team is architecting a family of products that handle over a billion files a day. \nWe take on the complexities of technology that affect everyday life, so people can get back to living and doing their best work. \nThe heart of Dropbox is engineering; the heart of our engineering team are our Staff Engineers, who set the tone and pace of engineering at Dropbox. \nStaff Engineers work at a cross-engineering scope, driving impact felt by hundreds of Dropboxers and millions of customers. \nAs a Staff Software Engineer, you will contribute in a multitude of ways, from architecting phenomenal systems, creating and encouraging good software development practices engineering-wide, driving strategic technical improvements, and mentoring other engineers. \nDropbox is a unique opportunity to work with best-in-class engineers on very large engineering problems, but in an environment with small teams and abundant opportunities for personal impact and growth. \nResponsibilities You will set direction not only for the team but will help guide engineering vision You will architect important systems and anticipate strategic and scaling-related challenges via thoughtful long-term planning You will write code as we expect our technical leadership to be in the trenches alongside junior engineers, understanding root causes and leading by example You will mentor engineers, both junior and senior You will own relationships with other engineering teams and collaborate with other functions within Dropbox Requirements BS (or higher, e.g., MS, or PhD) in Computer Science or related technical field involving coding (e.g., physics or mathematics), or equivalent technical experience 15+ years of professional software development experience Solid CS fundamentals with experience across a range of disciplines, with one or more area of deep knowledge and experience Proven track record of senior technical leadership Strong knowledge of shipping impactful and complex software projects Ability to set technical and cultural standards for engineers",
    "jobActivity": [
      "Posted 30+ days ago"
    ],
    "benefits": [],
    "hiringInsights": []
  },
  {
    "title": "Senior Backend Product Software Engineer - Remote",
    "company": "Dropbox",
    "salary": "Job type",
    "location": "Toronto, ON",
    "reviews": "",
    "stars": "",
    "jobType": [
      "Job type",
      "Remote"
    ],
    "jobDescription": "Role Description Our strategy starts with our mission: how do we build the right set of products that can help our customers work in a more enlightened way? \nIf the first big problem Dropbox solved was getting your files in the cloud, the new problem we re solving is helping you organize your life. \nAs we re evolving the core business from syncing and sharing files, we are looking for Senior Software Engineers to come build the next generation of new products for collaboration and distributed work. \nProduct Engineers thrive working across technologies and codebases, but are also involved in leading various product development cycle stages. \nAlong the way they are expected to fully represent the users needs through close partnership with product, design, and user research. \nIn this role you will build best-in-breed software by architecting and delivering scalable systems that power optimized user experiences like Dropbox Paper, Transfer, or Family. \nAs a Senior Product Engineer, you will support data-driven approaches to conduct experiments or iterate features, while ensuring that the software we write will last and scale. \nYou advocate for simple solutions and designs over complex ones, knowing when to move fast and when to do things right. \nResponsibilities You will articulate a technical vision for a more enlightened way of working and work with multi-functional partners to deliver that vision You will write code as we expect our technical leadership to be in the trenches alongside junior engineers, understanding root causes and leading by example You will partner with product managers, designers and analysts to deeply understand the needs of our users and build a product that serves those needs You will develop and execute against both short and long-term roadmaps, making effective tradeoffs between business impact, user experience, and a high-quality technical foundation You will improve the team and company you will be an active participant in our culture (mentorship, interviewing, and new initiatives) You will own relationships with other engineering teams and collaborate with other functions within Dropbox Requirements BS degree in Computer Science or related technical field involving coding (e.g., physics or mathematics), or equivalent technical experience 5+ years of software engineering and/or work related industry experience Previous success developing and shipping a large-scale web application with a user-empathetic mindset Skilled at building user-facing software and supporting systems and libraries for the web and/or desktop You can handle full-stack projects and are able to build a minimum working product quickly Total Rewards Our Engineering Career Framework is viewable by anyone outside the company and describes what s expected for our engineers at each of our career levels. \nCheck out our blog post on this topic and more here. \nAt Dropbox, we strive to be a great place for all Dropboxers to grow and be recognized for that growth. \nThis job posting reflects broad requirements, and represents two potential levels of role. \nThrough our assessment process, we will identify your level that ties to compensation based on your experience and technical expertise along with the scope of the role. \nFor candidates hired in San Francisco metro, New York City metro, or Seattle metro, the expected salary/On-Target Earnings (OTE) range for the role is currently $187,000 - $220,000 - $253,000 if you are assessed at the IC3 level. \nIf you are instead assessed at the IC4 level, the expected salary/On-Target Earnings (OTE) range for the role is currently $206,600 - $243,000 - $279,500. \n\nFor candidates hired in the following locations: Austin (TX) metro, Chicago metro, California (outside SF metro), Colorado, Connecticut (outside NYC metro), Delaware, Massachusetts, New Hampshire, New York (outside NYC metro), Oregon, Pennsylvania (outside NYC or DC metro), Washington (outside Seattle metro) and Washington DC metro, the expected salary/On-Target Earnings (OTE) range for the role is currently $168,300 - $198,000 - $227,700 if you are assessed at the IC3 level. \nIf you are instead assessed at the IC4 level, the expected salary/On-Target Earnings (OTE) range for the role is currently $185,900 - $218,700 - $251,500. \nFor candidates hired in all other US locations, the expected salary/On-Target Earnings (OTE) range for this role is currently $149,600 - $176,000 - $202,400 if you are assessed at the IC3 level. \nIf you are instead assessed at the IC4 level, the expected salary/On-Target Earnings (OTE) range for the role is currently $165,200 - $194,400 - $223,600. \nRange(s) is subject to change. Dropbox takes a number of factors into account when determining individual starting pay, including job and level they are hired into, location/metropolitan area, skillset, and peer compensation. \nDropbox uses the zip code of an employee s remote work location to determine which metropolitan pay range we use. \nSalary/OTE is just one component of Dropbox s total rewards package. \nAll regular employees are also eligible for the corporate bonus program or a sales incentive (target included in OTE) as well as stock in the form of Restricted Stock Units (RSUs).",
    "jobActivity": [
      "Posted 9 days ago"
    ],
    "benefits": [],
    "hiringInsights": []
  },
  {
    "title": "Software Engineer",
    "company": "Instacart",
    "salary": "Job type",
    "location": "Toronto, ON",
    "reviews": "920 reviews",
    "stars": "3.1 out of 5 stars from 920 employee ratings",
    "jobType": [
      "Job type",
      "Remote"
    ],
    "jobDescription": "We're transforming the grocery industry \n   At Instacart, we invite the world to share love through food because we believe everyone should have access to the food they love and more time to enjoy it together. Where others see a simple need for grocery delivery, we see exciting complexity and endless opportunity to serve the varied needs of our community. We work to deliver an essential service that customers rely on to get their groceries and household goods, while also offering safe and flexible earnings opportunities to Instacart Personal Shoppers. \n   Instacart has become a lifeline for millions of people, and we're building the team to help push our shopping cart forward. If you're ready to do the best work of your life, come join our table. \n   Instacart is a Flex First team \n  There's no one-size fits all approach to how we do our best work. Our employees have the flexibility to choose where they do their best work—whether it's from home, an office, or your favorite coffee shop—while staying connected and building community through regular in-person events. Learn more about our flexible approach to where we work.\n \n  OVERVIEW \n  ABOUT THE ROLE \n  We are investing heavily in the next-generation of our services. At our velocity and volume-level we need the ability to deploy new products and features faster and better. That's our choice for the traditional 3-dimensional engineering trade-off decision. Come help to build the best new user experience anywhere. We are creating new architectural designs and new services that couple best-in-class engineering with highly-informed business knowledge. \n  ABOUT THE TEAM \n  The Enrichment team's mission is to improve retailers' catalogs by enhancing product information and associations to drive sales growth and delight customers. To achieve this, we enrich product data in ways that help customers make informed decisions about their purchases. Our team maintains a variety of data pipelines using Snowflake and Flink, with the necessary logic to join the different data sources (including integrations with retailers, brands, and CPGs) and produce the best product information we can. We also build APIs to access some of this data to enable a variety of use cases, such as Advertising for retailers. \n  ABOUT THE JOB \n  \n  We work in small teams with significant ownership and autonomy over your project \n  Design, implement, and ship high quality features with a strong sense of urgency and accountability \n  Work closely with product managers, designers, data scientists, and peer engineering teams to define project requirements and execution plans \n  Ensure that system designs including APIs, deployment architecture, and dependency selection result in highly scalable, robust solutions that minimize support costs and improve an outstanding customer experience \n  Contribute broadly to Instacart's success by exercising your freedom to suggest and drive organization-wide initiatives \n  \n ABOUT YOU \n  MINIMUM QUALIFICATIONS \n  \n  Recent Bachelor's degree in Computer Science, computer engineering or electrical engineering \n  Between 0-1 years of total work experience post graduation \n  A strong sense of ownership \n  Self-motivation and an enjoyment for a startup environment \n  \n PREFERRED QUALIFICATIONS \n  \n  Relevant and recent internship experience as a software engineer \n  \n Join us and help Instacart grow! \n  #LI-Remote\n \n   Accommodations & Accessibility \n   At Instacart, we strive to create an accessible and inclusive experience for all candidates. If you need assistance submitting an application through our career site due to a disability, please submit an Accommodations Request Form and someone from our team will reach out soon to see how we may be able to assist.",
    "jobActivity": [
      "Posted 11 days ago"
    ],
    "benefits": [],
    "hiringInsights": []
  },
  {
    "title": "Software Engineering Manager",
    "company": "DarkVision",
    "salary": "",
    "location": "North Vancouver, BC",
    "reviews": "4 reviews",
    "stars": "5 out of 5 stars from 4 employee ratings",
    "jobType": [],
    "jobDescription": "Role Description \n  We are looking for a talented Software Engineering Manager to help us lead the development of our embedded, desktop, and cloud applications. If you have a knack for managing a team of programmers to motivate them to drive towards a common goal, we are looking for you. \n  As a Software Engineering Manager, you will direct, manage, and mentor a team of Software Engineers. Your team will be responsible for the development and release of complex software products for our ultrasound imaging devices. You will provide technical leadership, planning, and direction for your team. You will work with the Product, Research, and Data Analysis teams to define the scope and priority of work within the structure of an Agile development workflow. You will be responsible for the quality and robustness of the software your team develops. You will have to be a technically strong, hands-on leader not afraid to get your hands dirty. \n  This role will be based out of DarkVision's head office in North Vancouver, Canada and report to our Director of Software Engineering. \n  Responsibilities: \n  \n  Provide hands-on technical leadership, including architecture, design, and code reviews. \n  Advocate and advance modern software development practices. \n  Manage, mentor, and nurture the growth of a SW engineering team. \n  Hire, retain, and grow top talent on the team while fostering a relaxed team atmosphere. \n  Work with the Director of Software Engineering to build a great team culture and high-quality products. \n  Plan and coordinate requirements, dependencies, and priorities with the Product, Research, and Data Analysis groups to steer product development in an Agile manner. \n  Get your hands dirty and write some code when it makes sense. \n  \n Expectations: \n  \n  Bachelor of Computer Engineering, Software Engineering, or Computer Science \n  Experience with Agile (Scrum) methodology \n  Experience managing a software team \n  Excellent communication skills, verbal and written \n  Experience with full-stack development preferred (including cloud services) \n  Meticulous attention to detail \n  C++ programming experience \n  This role is predominately on-site but have flexibility to work from home a couple days a week \n  \n Opportunities to Learn: \n  \n  Industrial ultrasound for non-destructive testing \n  Image processing and GPU programming \n  Embedded Linux Development \n  Cloud Services (AWS, Docker, and Database Development) \n  Machine Learning application \n  \n What's in it for you? \n  \n  Competitive salary or higher (Top $ for top talent). \n  Full benefits package. \n  Up to 8 weeks of vacation (Yes, you read that correctly!) \n  Flexible hybrid work environment. \n  Lots of autonomy, interesting work, industry leading technology. \n  \n About DarkVision \n  DarkVision Technologies Inc. is a BC-based tech company that has been disrupting the industrial imaging market since 2013. We have created the world's most advanced acoustic-based imaging platform and are packaging it into multiple new product lines, revolutionizing how our clients quantify and visualize the integrity of their critical assets. \n  Backed by Koch Industries, the largest privately held company in North America, DarkVision's team of Mechanical, Skunkworks, Electrical, Software, and Machine Learning Engineers is rapidly expanding to meet the demand for the company's current and upcoming products. \n  We provide employees the opportunity to work on cutting-edge technologies that blend science with real-world applications and invite you to join our team for the exciting journey ahead as we become the global leader in industrial imaging. \n  Why DarkVision: \n  Here are 4 reason's you'll like working at DarkVision: \n  \n  Well-Funded: We are backed by Koch Industries - North America's largest privately held company and are actively working with top-tier operators across North America. \n  'A' Players: Our team is made up of talented, intelligent, and hardworking people. If you're an 'A' player, you'll enjoy the intellectually stimulating, challenging and respectfully competitive atmosphere. \n  Growing Quickly: We are in the process of launching several new product lines and as a result have more than doubled our headcount over the last year. \n  Lots of Opportunities: We are transitioning into a much larger organization and will soon be expanding into a 52,000 sq ft facility near the Lonsdale Quay in North Vancouver. We have recently opened a larger Calgary office and have expanded into the US, with offices in Houston and Midland, TX.",
    "jobActivity": [
      "Posted 30+ days ago"
    ],
    "benefits": [
      "Work from home"
    ],
    "hiringInsights": []
  },
  {
    "title": "Senior Front End Product Software Engineer - Remote",
    "company": "Dropbox",
    "salary": "Job type",
    "location": "Toronto, ON",
    "reviews": "",
    "stars": "",
    "jobType": [
      "Job type",
      "Remote"
    ],
    "jobDescription": "Role Description Our strategy starts with our mission: how do we build the right set of products that can help our customers work in a more enlightened way? \nIf the first big problem Dropbox solved was getting your files in the cloud, the new problem we re solving is helping you organize your life. \nAs we re evolving the core business from syncing and sharing files, we are looking for Senior Software Engineers to come build the next generation of new products for collaboration and distributed work. \nProduct Engineers thrive working across technologies and codebases, but are also involved in leading various product development cycle stages. \nAlong the way they are expected to fully represent the users needs through close partnership with product, design, and user research. \nIn this role you will build best-in-breed software by architecting and delivering scalable systems that power optimized user experiences like Dropbox Paper, Transfer, or Family. \nAs a Senior Product Engineer, you will support data-driven approaches to conduct experiments or iterate features, while ensuring that the software we write will last and scale. \nYou advocate for simple solutions and designs over complex ones, knowing when to move fast and when to do things right. \nResponsibilities You will articulate a technical vision for a more enlightened way of working and work with multi-functional partners to deliver that vision You will write full-stack code as we expect our technical leadership to be in the trenches alongside junior engineers, understanding root causes and leading by example You will partner with product managers, designers and analysts to deeply understand the needs of our users and build a product that serves those needs You will develop and execute against both short and long-term roadmaps, making effective tradeoffs between business impact, user experience, and a high-quality technical foundation You will improve the team and company you will be an active participant in our culture (mentorship, interviewing, and new initiatives) You will own relationships with other engineering teams and collaborate with other functions within Dropbox Requirements BS degree in Computer Science or related technical field involving coding (e.g., physics or mathematics), or equivalent technical experience 5+ years of software engineering and/or work related industry experience Previous success developing and shipping a large-scale web application with a user-empathetic mindset Skilled at building user-facing applications and supporting systems and libraries on web and/or desktop using front-end technologies such as JavaScript, TypeScript, React, Angular, HTML5, CSS3 You can handle full-stack projects and are able to build a minimum working product quickly",
    "jobActivity": [
      "Posted 30+ days ago"
    ],
    "benefits": [],
    "hiringInsights": []
  },
  {
    "title": "Front End and Full Stack Developer",
    "company": "Ample Insight Inc.",
    "salary": "Job type",
    "location": "Toronto, ON",
    "reviews": "",
    "stars": "",
    "jobType": [
      "Job type",
      "Full-time"
    ],
    "jobDescription": "Company Description\n  You will join a world-class team of engineers and data scientists from Facebook, Uber, Amazon and Google. We are a fast growing consulting firm based in Toronto with clients ranging from leading startups building impactful technologies to Fortune 500 companies looking to scale their engineering and data capabilities.\n \n \n\n Job Description\n  We are looking for an ambitious Jr to Intermediate Fullstack Engineer/Developer. You are passionate about technology but very pragmatic in the application of it to real-world engineering problems. You have experience in launching new products and scaling them. Critical thinking and problem-solving skills are essential for this role.\n  At Ample Insight, you will have a unique opportunity to work with best-in-class engineers on large engineering problems, and in an environment with small teams and abundant opportunities for personal impact and growth.\n  Please note that although this role is remote, you are required to be located in Canada (preferably in the Greater Toronto Region).\n \n \n\n Qualifications\n  Responsibilities\n \n   You will be part of a small but highly impactful team, with a large amount of ownership and autonomy for managing things directly.\n   You will architect important systems and anticipate strategic and scaling-related challenges via thoughtful long-term planning\n   You will need to design, prototype, and create solutions that support highly reliable, scalable, performant SaaS products\n   You will own relationships with other engineering teams and collaborate with other functions\n \n  Requirements\n \n   BS (or MS/PhD) in Computer Science or related engineering field involving coding\n   2+ years of professional software development experience\n   1+ years of experience working with React, Node, Typescript\n   Solid CS fundamentals with experience across a range of disciplines, with one or more area of deep knowledge and experience\n   Proven track record of technical expertise at a company with a strong engineering culture\n   Experience setting technical strategy for an important company initiative\n   Experience with shipping software\n \n  Additional Information\n  We have competitive compensation.\n  Work on cool projects based on your interests and skills. We believe in accountability and NOT micro-management.",
    "jobActivity": [
      "Posted Today"
    ],
    "benefits": [],
    "hiringInsights": []
  },
  {
    "title": "Software Developer Engineer",
    "company": "Alba Inc",
    "salary": "Salary",
    "location": "Toronto, ON",
    "reviews": "",
    "stars": "",
    "jobType": [
      "Salary",
      "$80,000–$150,000 a year"
    ],
    "jobDescription": "Full Job Description\nAbout the team\nWe are looking for world class software engineers to join our technology innovation group focused on the rapid development of telecommunications.\nAnd dedicated to providing the very best Open RAN solution available with an emphasis on\nLTE/NR Radios and ORAN system integration.\nYou will work with a team of intelligent, ambitious, and hard-working software professionals recruited from reputed universities and industries. The team is responsible for the Architect, design, development, quality, and maintenance of the next-generation telecommunication. Other responsibilities include transforming product requirements into Technical Design/Implementation & writing technical requirements.\nAbout the role\n\n Design, development of software systems following micro services-based structure in scrum workflow. Architect and develop new features. Work within a small, agile team, following a sprint methodology\n Deliver features and performance tests and code reviews.\n Design and build scalable and reliable microservices.\n Helps product owner to make the product backlogs in good shape and make them ready for the next sprint.\n Involve in release planning and track the product delivery.\n\nJob requirements\n\n 3+years of software related experience.\n Bachelor’s degree or above in computer, electronics, communication related majors is preferred.\n Writing elegant, maintainable, self-documenting code. Have experience with micro services or high-volume API based applications.\n Familiar with one or more programming languages, such as C++, Java; Familiar with Linux programming.\n Experience with Agile tools like Jira, Rally.\n Strong self-motivated, willing to learn new knowledge to adapt to the new environment, optimistic and self-confident, able to challenge self and constantly pursue excellence.\n Have good communication skills and teamwork spirit.\n\nJob Types: Full-time, Permanent\nSalary: $80,000.00-$150,000.00 per year\nSchedule:\n\n 8 hour shift\n Day shift\n Monday to Friday\n\nSupplemental pay types:\n\n Bonus pay\n\nAbility to commute/relocate:\n\n Toronto, ON: reliably commute or plan to relocate before starting work (required)\n\nWork Location: One location",
    "jobActivity": [
      "Posted 2 days ago"
    ],
    "benefits": [],
    "hiringInsights": [
      "Hiring 10+ candidates for this role"
    ]
  },
  {
    "title": "Senior Software Developer",
    "company": "Audioptics Medical, Inc.",
    "salary": "Salary",
    "location": "Halifax, NS",
    "reviews": "",
    "stars": "",
    "jobType": [
      "Salary",
      "From $70,000 a year"
    ],
    "jobDescription": "About the Company\nAudioptics Medical is a medical imaging device OEM developing a non-invasive diagnostic imaging technology for imaging the middle ear. Our mission is to provide ear surgeons with a better ability to diagnose conductive hearing loss and to anticipate what they are going to encounter in the operating room and, in doing so, dramatically reduce the number of exploratory surgeries they perform.\nWe are developing custom hardware, firmware, and software, to power our flagship product, the Ossiview Middle Ear Imaging System (www.audiopticsmedical.com). Audioptics runs a lean development team and seeks technical team members with diverse skillsets that can contribute on multiple fronts.\nBenefits:\nBesides working with our amazing team, we offer a few other perks!\n\n We encourage a healthy work/life balance\n Company-paid extended healthcare benefits\n Option to participate in our employee stock option plan\n Paid annual vacation and sick leave\n Regular team building events and workshops\n\nAbout the Role:\nWe’re looking for an experienced and knowledgeable software developer who has a knack for improving software design and applying meaningful design patterns to an existing code base. You’re the kind of developer that has a reputation for producing readable, maintainable, and extendable C++ code with test coverage. You’ll contribute to an overall software effort aimed at enabling game-changing diagnostic capabilities with Ossiview, in a streamlined UI that is optimized for doctors to efficiently generate meaningful and intuitive results.\nMust haves:\n\n University degree in Computer Science\n Strong C++ experience (at least 5 years experience in professional setting)\n Object-Oriented design, SOLID principles and Design Patterns\n Unit-testing & test-driven development methodologies\n Git\n Experience documenting software development\n Strong communication skills (written and spoken)\n\nNice To Have:\n\n Experience with image processing and common algorithms (FFT, filtering, equalization)\n Experience with data visualization, plotting\n Experience with Atlassian suite (Jira + Confluence)\n Experience working in a Software Agile environment\n Experience documenting software architecture\n Qt\n Knowledge of HIPPA/PHIA\n Prior experience in healthcare technology\n\nIn addition to the above, we will love to see how you have demonstrated:\n\n Working independently\n Being detail-oriented\n Being able to propose changes and communicate them effectively\n Great team spirit\n\nJob Type: Full-time\nSalary: From $70,000.00 per year\nBenefits:\n\n Casual dress\n Dental care\n Disability insurance\n Extended health care\n Flexible schedule\n Flextime\n Life insurance\n Paid time off\n Relocation assistance\n Stock options\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n\nAbility to commute/relocate:\n\n Halifax, NS: reliably commute or plan to relocate before starting work (required)\n\nEducation:\n\n Bachelor's Degree (required)\n\nExperience:\n\n C++: 5 years (required)\n Python: 3 years (required)\nFlextime",
    "jobActivity": [
      "Posted 30+ days ago"
    ],
    "benefits": [
      "Casual dressDental careDisability insuranceExtended health careFlexible scheduleFlextimeLife insurancePaid time offRelocation assistanceStock optionsVision care"
    ],
    "hiringInsights": [
      "Application response rate: 61%",
      "Hiring 1 candidate for this role"
    ]
  },
  {
    "title": "Senior Developer",
    "company": "Energera Inc.",
    "salary": "Job type",
    "location": "Acheson, AB",
    "reviews": "",
    "stars": "",
    "jobType": [
      "Job type",
      "Full-time"
    ],
    "jobDescription": "We are putting together teams to build the next generation of products and services to address a range of IT, OT, and IoT use cases (including real-time data acquisition, site access control, visitor management and customer data driven insights); and are exploring ways to leverage machine learning and AI across our products. If this is your story, we have a compelling position for you. You could make a difference in the new era of energy and participate in making energy production cleaner, safer and more efficient. We value clean architecture and modern approaches to software development and testing. Our products consist of cloud-based micro-services and modern web and mobile applications. You will work closely with a tight, agile team with the aim to ship features continuously.\n  ABOUT US\n  Energera is innovating enertech solutions to solve some of the biggest problems the energy industry is currently facing. Our Frac Shack, NG Sidekick and Sandtinel solutions are smarter, greener, safer and cleaner. Our team includes employees who are high energy, creative and passionate about what they do. As a company, we pride ourselves on building a culture that values employees and promotes innovation, diversity, excellence in communication and commitment to personal/professional growth. We believe that collaboration and forging new relationships will allow us to protect the planet and reach the standard that we know is possible. Let's do this together!\n  SUMMARY:\n  The Senior Developer React Native / Javascript mentors to help inspire and guide our junior (and enthusiastic) team members in fundamentals, advanced techniques, and best practices. As a Senior Developer, you’ll be working as part of a team to build cloud micro-services that are resilient, fault-tolerant and performant, while working with other teams to determine which features and functionality you can add to improve customer experience. In order to do that, you'll need to have technical depth; architectural thinking; and the ability to work as part of distributed team.\n  SPECIFIC DUTIES AND RESPONSIBILITIES include but are not limited to the following: \n \n  You love writing software, your code is comprehensible, well-structured and highly performant;\n   Your best days at work are in front of the computer cranking out code, although you have the experience to know that a winning product requires an entire team;\n   You love both learning and teaching. In this role, you will be interfacing with design, front-end, back-end, platforms, analytics, as well as stakeholders; you enjoy working across teams to solve hard problems;\n   Participate in project scoping activities;\n   Establish project goals and planning;\n   Complete technical review of the dev teams work and provide coaching / corrective feedback;\n   Determine testing scenarios and oversee improvements;\n   Serve as the subject matter expert for work execution, tools and systems supporting and interfacing;\n   Perform high level functional activities, such as requirements gathering and gap analysis of user requirements, requires functional and business expertise;\n   Participate in the design specifications, configuration, testing, implementation; and\n   Support future process improvements and product development/solution roadmap.\n   Compliance with quality and safety management requirements\n \n  QUALIFICATIONS:\n \n   A Computer Science degree, or equivalent experience;\n   7+ years of experience working in mobile applications;\n   7+ years of experience writing JavaScript applications;\n   Extensive React Native experience;\n   Experience with cloud development, ideally Azure;\n   Expertise in service-oriented architectures; ideally, you've developed APIs for both internal and external-facing services; and\n   You're obsessed with performance, and have experience with monitoring services to ensure the application is behaving as expected\n   Experience building complex, scalable, high-performance software systems that have been successfully delivered to customers\n   Experience designing and deploying dynamically scalable, highly available, fault tolerant and reliable cloud applications (Azure Preferred)\n   Certifications with Azure (or AWS) Cloud Technologies\n   Exceptional communication and organizational skills\n   Always approachable and professional in approach\n   Able to keep several projects/tasks moving forward at once; nothing slips through the cracks\n   Capable of working in an unsupervised environment; proactive; doesn't wait for instruction\n   Ability to prioritize and adapt to change.\n   A commitment to excellence\n \n \n  WHAT WE OFFER\n \n   Salary - Negotiable\n   Medical and dental benefits\n   Hybrid Working Environment (Tuesdays and Thursdays remote)\n   401K with company match\n \n  Energera is an Equal Opportunity Employer.\n  We thank all applicants for their interest, however only those candidates selected for interviews will be contacted.",
    "jobActivity": [
      "Posted 30+ days ago"
    ],
    "benefits": [
      "Dental care"
    ],
    "hiringInsights": []
  },
  {
    "title": "Software Engineer- JAVA",
    "company": "Sun Life",
    "salary": "Salary",
    "location": "Toronto, ON",
    "reviews": "1,534 reviews",
    "stars": "3.9 out of 5 stars from 1,534 employee ratings",
    "jobType": [
      "Salary",
      "$80,000 a year"
    ],
    "jobDescription": "You are as unique as your background, experience and point of view. Here, you’ll be encouraged, empowered and challenged to be your best self. You'll work with dynamic colleagues - experts in their fields - who are eager to share their knowledge with you. Your leaders will inspire and help you reach your potential and soar to new heights. Every day, you'll have new and exciting opportunities to make life brighter for our Clients - who are at the heart of everything we do. Discover how you can make a difference in the lives of individuals, families and communities around the world.\n \n  Job Description:\n  Application Analyst – Java Applications Support\n \n  Job Description:\n \n  The Corporate Applications Services (CAS) IT team is looking for an looking for an Application Developer with at least 5 years of JAVA application support, analysis, and development experience.\n  The successful incumbent will have strong technical and problem solving skills and the ability to work independently. As a member of the team that supports JAVA applications, responsibilities include application support, responding to service requests, debugging and problem solving, security reviews, maintaining stability, requirements analysis, performance and tuning, application\n  development and unit testing, writing technical specifications, as well as participation in transitions to support and design reviews. The desirable candidate will show initiative, be accepting of responsibility and be accountable for results.\n \n  What will you do?\n \n   Provide ongoing support of JAVA application systems in production including responding to service requests, problem analysis, resolution, escalation and reporting as necessary\n   Identify and participate in improvement, system renewal, stability, upgrade, and Disaster Recovery projects\n   As a member of the operations support team, interface with developers, infrastructure teams, system\n   designers, business system analysts, application analysts and testing specialists to deliver high quality solutions and maintain a stable, high performing application environment\n   Create and maintain supporting documentation\n   Participate in various review processes - e.g Business Requirements, Test plans, Design\n   reviews, etc to gain a solid understanding of the application and provide input into the various deliverables from a support perspective\n   Design, develop, code, test, and debug programs for various projects\n   This role includes on-call and after hours support on a team rotation basis\n \n \n  What do you need to succeed?\n \n   4+ years of information technology experience in JAVA application support and development\n   University degree in Computer Science or equivalent experience\n   Strong working knowledge of Java, J2EE, Weblogic, Eclipse\n   Experience with Spring Boot and Spring MVC Frameworks for application development\n   Experience with JPA (Java Persistent Architecture Framework) for DB interactions\n   Strong knowledge of relational databases (Oracle, MS SQL Server, PostGreSQL)\n   Strong knowledge of Web technologies (HTTP/HTTPS, HTML, CSS, Javascript, Jquery, JSP, Servlet, JDBC, MVC)\n   Experience with Unix, Ajax, WebSphere Liberty\n   Experience with the DevOps tools (Git, Bitbucket, Jenkins, CDD, Ansible)\n   Experience with cloud based platforms (AWS Amazon Web Services)\n   Solid understanding of distributed application packaging, deployment, and performance management\n   Experience with React.js technologies is an asset\n   Strong leadership, planning, organizational and consulting skills\n   Ability to communicate effectively to technical and nontechnical audiences and work with business partners as well as infrastructure teams\n   Self-starter, fast learner and ability to multitask\n \n \n  The Base Pay range is for the primary location for which the job is posted. It may vary depending on the work location of the successful candidate or other factors. In addition to Base Pay, eligible Sun Life employees participate in various incentive plans, payment under which is discretionary and subject to individual and company performance. Certain sales focused roles have sales incentive plans based on individual or group sales results.\n \n  Diversity and inclusion have always been at the core of our values at Sun Life. A diverse workforce with wide perspectives and creative ideas benefits our clients, the communities where we operate and all of us as colleagues. We welcome applications from qualified individuals from all backgrounds.\n \n  Persons with disabilities who need accommodation in the application process or those needing job postings in an alternative format may e-mail a request to thebrightside@sunlife.com.\n \n  At Sun Life we strive to create a flexible work environment where our employees are empowered to do their best work. Several flexible work options are available and can be discussed throughout the selection process depending on the role requirements and individual needs.\n \n  We thank all applicants for showing an interest in this position. Only those selected for an interview will be contacted.\n \n  Salary Range: 80,000/80 000 - 130,400/130 400\n \n  Job Category: IT - Application Development\n \n  Posting End Date: 30/03/2023",
    "jobActivity": [
      "Posted 1 day ago"
    ],
    "benefits": [],
    "hiringInsights": []
  }
]